rkz/extension/Documents/ПлановаяКалькуляция2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПлановаяКалькуляция2_2</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектыКалькуляции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_НеактуальныеЦеныВПлановойКалькуляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_НеактуальныеЦеныВПлановойКалькуляции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлубинаОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлубинаУстановленнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлановаяКалькуляция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановаяКалькуляция2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Documents/ПлановаяКалькуляция2_2/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] + 
	НоваяКоманда = Команды.Добавить("бит_ОткрытиеУстаревшиеЦены");
	НоваяКоманда.Заголовок = "";
	НоваяКоманда.Действие = "бит_ОткрытиеУстаревшиеЦены";
	
	НовыйЭлемент = Элементы.Вставить("бит_УстаревшниеЦены", Тип("ДекорацияФормы"),, Элементы.Страницы);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "Плановая калькуляция рассчитана по устаревшим ценам";
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "бит_ОткрытиеУстаревшиеЦены");
	НовыйЭлемент.УстановитьДействие("Нажатие", "бит_ОткрытиеУстаревшиеЦены");
	НовыйЭлемент.Видимость = Ложь;	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] - 
	
	// {{ПервыйБИТ ЛистТребований [ЛТ0.1] [ASHolyavko@1cbit.ru] [25.11.2025] +        
	
	//Кнопка
	Команда = ЭтаФорма.Команды.Добавить("бит_УстановкаЦенНоменклатуры");
	Команда.Действие = "бит_УстановкаЦенНоменклатуры";
	Команда.Заголовок = "(бит) Установка цен номенклатуры";
	
	//Добавляем новую кнопку
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_УстановкаЦенНоменклатуры", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Заголовок = "(бит) Установка цен номенклатуры";
	НовыйЭлемент.ИмяКоманды = "бит_УстановкаЦенНоменклатуры"; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ0.1] [ASHolyavko@1cbit.ru] [25.11.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытиеУстаревшиеЦены(Команда)
		
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] +
	ТабДок = бит_ПолучитьУстаревшиеЦены();	
	ТабДок.Показать();	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] -
	
КонецПроцедуры 

&НаСервере
Функция бит_ПолучитьУстаревшиеЦены()	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] + 
	ТабДок = Новый ТабличныйДокумент;
	ДокОбъект= РеквизитФормыВЗначение("Объект"); 
	Макет = ДокОбъект.ПолучитьМакет("бит_Макет");
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапки);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.Номенклатура КАК Номенклатура,
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.Характеристика КАК Характеристика,
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.ГлубинаОтбора КАК ГлубинаОтбора,
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.ГлубинаУстановленнойЦены КАК ГлубинаУстановленнойЦены
	               |ИЗ
	               |	РегистрСведений.бит_НеактуальныеЦеныВПлановойКалькуляции КАК бит_НеактуальныеЦеныВПлановойКалькуляции
	               |ГДЕ
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.ПлановаяКалькуляция = &Калькуляция";
	Запрос.УстановитьПараметр("Калькуляция", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьСтроки.Параметры.НоменклатураХарактеристика = Строка(Выборка.Номенклатура) + ","; 
		ОбластьСтроки.Параметры.ГлубинаОтбора = Формат(Выборка.ГлубинаОтбора, "ЧЦ=; ЧГ=");
		ОбластьСтроки.Параметры.ГлубинаУстановленнойЦены = Формат(Выборка.ГлубинаУстановленнойЦены, "ЧЦ=; ЧГ=");
		ТабДок.Вывести(ОбластьСтроки);
	КонецЦикла;    
	Возврат ТабДок;	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] -
	
КонецФункции

&НаКлиенте
&После("КонтрольРасчетаПотребностей")
Процедура бит_КонтрольРасчетаПотребностей()	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] +
	Элементы.бит_УстаревшниеЦены.Видимость = бит_ПроверитьУстаревшиеЦены();	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] -	
КонецПроцедуры 

&НаСервере 
Функция бит_ПроверитьУстаревшиеЦены() 	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] +
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.Номенклатура КАК Номенклатура,
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.Характеристика КАК Характеристика,
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.ГлубинаОтбора КАК ГлубинаОтбора,
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.ГлубинаУстановленнойЦены КАК ГлубинаУстановленнойЦены
	               |ИЗ
	               |	РегистрСведений.бит_НеактуальныеЦеныВПлановойКалькуляции КАК бит_НеактуальныеЦеныВПлановойКалькуляции
	               |ГДЕ
	               |	бит_НеактуальныеЦеныВПлановойКалькуляции.ПлановаяКалькуляция = &Калькуляция";
	Запрос.УстановитьПараметр("Калькуляция", Объект.Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой(); 	
	// Первыйбит Лист требований [20]  [Совветников Д.Г.] [04.07.2024] -
КонецФункции

&НаКлиенте
Процедура бит_УстановкаЦенНоменклатуры()
	
	// {{ПервыйБИТ ЛистТребований [ЛТ0.1] [ASHolyavko@1cbit.ru] [25.11.2025] +        
	
	Если Объект.Ссылка <> ПредопределенноеЗначение("Документ.ПлановаяКалькуляция2_2.ПустаяСсылка") Тогда
			
		//Форма = ПолучитьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта");
		//ДанныеФормы = Форма.Объект;
		//ПолучитьДокументУстановкаЦен(ДанныеФормы, ТекущиеДанные.Ссылка);
		//КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
		//Форма.Прочитать();
		//Форма.Открыть();
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Дата", Объект.Дата);	
		СтруктураЗаполнения.Вставить("ДокументОснование", Объект.Ссылка);
		Адрес = ПолучитьАдресТаблицыТоваров(Объект.Ссылка);
		СтруктураЗаполнения.Вставить("ТаблицаНоменклатуры", Адрес);
		СтруктураЗаполнения.Вставить("ЗагрузкаИзПлановойКалькуляции", Истина);
		П = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
		ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", П, ЭтаФорма);
		
	Иначе
		
		Сообщить("Перед вводом ""Установки цен"" сначала необходимо записать документ!");
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ0.1] [ASHolyavko@1cbit.ru] [25.11.2025] -
	
КонецПроцедуры


&НаСервере
Функция ПолучитьАдресТаблицыТоваров(ДокументКалькуляции)
	Возврат Документы.ПлановаяКалькуляция2_2.УстановкаЦенНоменклатуры(ДокументКалькуляции); 
КонецФункции
